[
    {
       "imageName":"kingdom",
       "name":"Colour Kingdom",
       "description":"First published by Aum Press in 1973. Published on srichinmoylibrary.com with the permission of Sri Chinmoy. This is the 70th book written by Sri Chinmoy after he came to the West in 1964."
    },
   {
      "imageName":"chinmoy",
      "name":"Indian Years",
      "description":"Sri Chinmoy (Chinmoy Kumar Ghose) was born on 27th August 1931. He was the youngest child of Shashi Kumar Ghose (his father) and Yogamaya Biswas (his mother). According to his horoscope the young Chinmoy was given the name of Ganapati. Ganapati is the name of the elephant god, the Hindu deity who removes obstacles from the path of a seeker. However, as young child, Chinmoy was known by the nickname of “Madal”; Madal, meaning “Kettledrum”, proved to be an appropriate name. His family recalls how as a child Madal, was very madalenergetic, inquisitive and at times mischievous. Sri Chinmoy has recounted many stories from his childhood in which he relates his childhood experiences in the small Indian village of Shakpura. In one story he mention that, as a young boy, his greatest desire was to become a ticket collector on a train. By contrast to Madal, his six elder brothers and sisters were quiet and reflective. When Madal was still an infant, his eldest brother, Hriday entered the Sri Aurobindo Ashram in the south of India. Sri Chinmoy recalls with great affection the love and concern his family members offered him as a young child. In particular, he expressed gratitude to his parents for wishing their children to lead a spiritual life. When Madal was only eleven, his father passed away, and, shortly after, his mother Yogamaya also left the world. As a consequence Chinmoy joined his brothers and sisters in entering the Sri Aurobindo Ashram under the guidance of Sri Aurobindo and The Mother. It was also on entering the ashram that Madal received his proper name of Chinmoy. His brother Chitta was the one to bestow on him this name. Chitta has written in his memoirs: “In 1936, when we visited the Sri Aurobindo Ashram, the Ashram Secretary, Nolini Kanta Gupta, wanted to know Madal’s real name, because Madal is a nickname. I was a little bit puzzled. What suitable name could we give to our youngest brother? Our eldest brother’s name is Hriday Ranjan. My name is Chitta Ranjan. My younger brother’s name is Manoranjan. Then Prana Ranjan was coming to my mind to give as Madal’s real name, but it was not satisfying my heart. All on a sudden, I got an inner message. A divine voice echoed and re-echoed in my heart: “Chinmoy, Chinmoy!” My human mind never thought that this name would one day be accepted, loved and adored by countless truth-seekers and God-lovers.” On joining the Ashram, Chinmoy became consciously awakened to the teenagespiritual life and felt an intense inner urge to realise God. During the years that followed, the young Chinmoy would meditate for several hours a day. He would wake up at 2.07am and meditate on his bed for several hours before his brother awoke. By the age of 13, he attained a state of self-realisation and would spend many hours in Samadhi or trance. Sri Chinmoy recalls one occasion, when after coming down from Samadhi, he forgot his own name; this was because he had become so immersed in the Transcendental Consciousness that he no longer identified with his body. Sri Chinmoy also describes another significant experience of meditation that took place when he was 14; this was an indication of his future spiritual mission in the West. As well as his own prayer and meditation, the young Chinmoy took an active part in sprintAshram life. He worked in various cottage industries and later worked as a secretary to Nolini Kanta Gupta, the General Secretary of the Ashram.  In addition, Chinmoy participated in and excelled in many athletic events. For 16 years consecutively he stood first in the 100m sprint and he was decathlon champion in 1958 and 1959. His childhood hero was the American sprinter Jesse Owens. (In 1972, Sri Chinmoy finally had the opportunity to meet the legendary Jesse Owens in America.) It was in his Ashram days that the young Chinmoy first started writing poetry. In 1946 he rendered Sri Aurobindo’s Bengali story ‘Kshamar Adarsha’, ‘The Ideal of Forgiveness’, into 200 lines of Bengali verse. It was published in the literary journal, Partha Sarathi, in March 1948 with an appreciative editorial note 6. He also rendered it into an English iambic pentmeter poem of 107 Lines in 1956. Significantly, the poem was read to Sri Aurobindo, who commented: “It is a fine piece of poetry. He has capacity. Tell him to continue.“ As a teenager, Chinmoy learnt Bengali metre and later English metre as well. This enabled him to write poetry in both Bengali and English. When writing poetry Sri Chinmoy often used to say lines of poetry would come to him spontaneously, as if they have been already composed. His first poem in English was “The Golden Flute.” As a teenager, Chinmoy learnt Bengali metre and later English metre as well. This enabled him to write poetry in both Bengali and English. When writing poetry Sri Chinmoy often used to say lines of poetry would come to him spontaneously, as if they have been already composed. His first poem in English was “The Golden Flute.” "
     
          
   },
   {
      "imageName":"m4",
      "name":"In the West",
      "description":"Sri Chinmoy would have been content to remain in the Ashram furthering his meditation and taking part in the daily activities; but, an inner Command urged him to travel to the West to share the spiritual knowledge of the East with aspiring seekers in the West. After receiving help from sponsors in America, Sri consulateChinmoy was able to leave India for America. Thus, on the 13th April 1964, Sri Chinmoy arrived in New York, USA where he continued to live up until his passing. Initially, he stayed in Greenwich Village. However, in order to be able to remain in America it was necessary for Sri Chinmoy to gain employment. He was able to secure employment as a junior clerk in the Passport and Visa section at the Indian Consulate. Sri Chinmoy recalled how he was fortunate to get the job because initially he failed the typing test. However, his boss, Mr. Mehrotra chose Sri Chinmoy because he admired his writings and saw something in his eyes. Sri Chinmoy worked for two years in the Passport and Visa section. Sri Chinmoy has recounted many stories from this period in a book entitled “My Consulate Years”. At times, he had little money, but he retained happy memories of these earliest experiences in the West. “In those days I was poverty-stricken, but my heart was full of joy.” Sri Chinmoy moved to Brooklyn and had to take a long subway journey to reach the Indian Consulate each day. However, he said he was grateful for these long journeys as they enabled him the opportunity to meditate in an otherwise hectic day. He later described some of his subway experiences in a book “My Subway Experiences”. On arriving in the West, Sri Chinmoy soon began giving talks and lectures on the subjects of Hinduism and Eastern spirituality. His first lecture was entitled “Hinduism: The Journey of India’s Soul” Over the course of time, seekers became eager to study in depth the teachings and spiritual philosophy of Sri Chinmoy. The first Sri Chinmoy Centre (at the time called the AUM Centre) was established in San Juan Puerto Rico in 1966; the second centre was formed in New York. The 1960’s witnessed significant social upheavals in America and the Western world. With a backdrop of the Vietnam war, new social movements became disenchanted with the prevailing societal norms and young people, in particular, began to look for different approaches to religion and life in general. Yoga and meditation began to permeate the public consciousness and became popular through high profile figures, such as the Beatles, practising meditation. Some of these members of the younger generation were attracted to the Eastern mysticism that was being taught by Indian Spiritual Masters, among whom was Sri Chinmoy. Following the ancient traditions of yoga, Sri Chinmoy was firm in stressing that real spirituality involved purity of mind and body. He teaches that the use of drugs is harmful to spirituality; in this respect he asks his students to refrain from taking drugs and alcohol. The consumption of these substances harms a seeker’s subtle nerves, making meditation more difficult. Some seekers who used to experiment with drugs did later confirm there was a world of difference between the “mystic” experiences induced by drugs and the real spiritual experience of meditation. In 1967, with the support of a growing number of disciples, Sri Chinmoy was able to devote himself full time to his spiritual mission. He was able to leave his job at the Indian Consulate and dedicate himself to writing, giving lectures and serving as a guide to his meditation students. On leaving the Indian Consulate, he received many kind comments from his co workers. His boss L.L. Mehrotra offered the following testimony: “Mr. Chinmoy Kumar Ghose has performed his responsibilities with an unflinching sense of duty, an unquestionable integrity and thorough sincerity. We wish him every success in his endeavours to spread India’s message of Truth and Love and spiritual disciplines such as Yoga.” In the late 1960’s and early 1970’s, Sri Chinmoy travelled extensively around America and also to Europe and Asia. He offered lectures and public meditations at many universities and colleges, including prestigious universities such as Harvard, Oxford and Cambridge. His lectures were on different themes related to spirituality and meditation. During these lecture tours, he also established the first Sri Chinmoy Meditation Centres in Europe and the Far East."
           
   },
   {
      "imageName":"m3",
      "name":"Yoga",
      "description":"Sri Chinmoy’s yoga is firmly rooted in the spiritual traditions of the Vedas and Upanishads; at the same time, it offers a unique exposition of these ancient ideals. Sri Chinmoy’s path encompasses the path of devotion (bhakti yoga), selfless service (Karma Yoga), meditation (dhyani yoga) and the yoga of wisdom (jnani yoga). Despite encompassing these many different aspects, Sri Chinmoy says that in essence: “Our path is the path of simplicity“15. In particular, he teaches that it is the qualities of the heart which enable the seeker to make the fastest progress: “Our path is basically the path of the heart and not the path of the mind. This does not mean that we are criticising the path of the mind. Far from it. We just feel that the path of the heart leads us faster towards our goal.” The heart is one of the main themes of Sri Chinmoy’s writings; he frequently encourages seekers to use the intuitive power of the heart, and not to rely only on the mind. He suggests that when we use the mind we are limited by our critical and negative thoughts; however, if we exercise the capacity of the heart we can have a feeling of oneness and experience the expansion of our consciousness. “There is a vast difference between what you can get from the mind and what you can get from the heart. The mind is limited; the heart is unlimited ” – Sri Chinmoy. As in other spiritual traditions, Sri Chinmoy reveals that the primary objective of a seeker is to attain self-realisation (or God-realisation) through prayer and meditation. But, in addition to this inner life, Sri Chinmoy also places great value on manifestation or dedicated action. In his own life, Sri Chinmoy demonstrated how one can combine a life of meditation and prayer with numerous outer activities. Another feature of Sri Chinmoy’s teaching is his encouragement to surpass one’s self-imposed limits. He gives this the term “self transcendence”. Talk on Self Transcendence at Yoga of Sri Chinmoy. Although a spiritual Teacher (Guru) to many, Sri Chinmoy teaches that the only real Guru is the Supreme himself. He considers himself to be an instrument of God, like an elder brother in the family guiding his other family members. Another important aspect of Sri Chinmoy’s yoga is affirmation of the underlying unity of world religions. Frequently he has stated how all religions ultimately lead to the same goal, even if their outer expressions are different. “There is no fundamental difference between one religion and another, because each religion embodies the ultimate Truth. Each religion is right, absolutely right, because each religion conveys the message of Truth in its own way” – Sri Chinmoy. When asked about his own religion, Sri Chinmoy would often state that, although he was raised a Hindu, his only religion was his ‘love of God’... “I happened to take birth in a Hindu family, but because I am a truth-seeker and a God-lover, I feel that there is only one religion and that religion is love of God. If we truly love God, we embrace all religions as our own, very own.”"
      
   },
   {
      "imageName":"m10",
      "name":"The United Nations",
      "description":" In 1970, under the auspices of U Thant, Sri Chinmoy was invited to begin an meditation group at the United Nations. The first meditation meeting was held on April 14th, 1970 at the Peace Room of the United Nations Church Centre 20 Later, On 29th February, 1972, Sri Chinmoy had the opportunity to meet with the third UN Secretary General U Thant at the United Nations. U Thant said of Sri Chinmoy: ““I have been hearing about you from many, many people. Whoever speaks to me about you is all appreciation and admiration, and I personally feel that you have been doing a most significant task for the United Nations..” Sri Chinmoy has written extensively on the United Nations expressing a belief that the United Nations expresses a most significant aspiration for world harmony and that it can be an important instrument for bringing people together to avoid conflict. “What does U.N. Day signify? It signifies a day of universal hope, a day of universal promise, a day of universal peace and a day of universal oneness.”"
       
   },
   {
      "imageName":"m8",
      "name":"Sporting Life",
      "description":"Throughout his life, Sri Chinmoy participated in sports.He has sought to show how sports can be harmonised with the spiritual life. His interest in sport was not as a means of competition, but for a practical way of implementing his philosophy of self-transcendence. In the 1978, at the age of 47, he turned to long distance running and trained hard to be able to complete 22 marathons and 3 ultra-marathons. His fastest marathon time was his first marathon in Chico, California, in which he clocked a time of 3:55:56 Often he would go training as early as 4am in the morning.  Sri Chinmoy wrote numerous accounts of his running experiences in his books “Run and Become”. In addition to encouraging his students to run, in the early 1970’s, Sri Chinmoy founded the Sri Chinmoy Marathon Team.The Sri Chinmoy Marathon Team organises a variety of races from short 2 mile races to triathlons to the world’s longest certified race of 3100 miles held annually in Queens, New York. In many ways the SCMT were a significant pioneer of the rapid growth in ultra running which took place in the 1980s. In addition to the 3100 mile race the SCMT have organised the ultra trio 700,1000 and 1300 and also the 7 day and 10 day races. In the late 1980’s, a knee injury curtailed Sri Chinmoy’s running career. He then weightliftingckgbecame inspired to take up weightlifting. This was a sport in which previously he had shown little interest, but right from the beginning of his weightlifting career, he was able to make unprecedented progress. Up until his Mahasamadhi (passing), in October, 2007, at the age of 76, Sri Chinmoy continued to lift a unique variety of different weights Bill Pearl (5 time Mr Universe) has acted as Master of Ceremonies at many of Sri Chinmoy’s weightlifting ceremonies. He has seen Sri Chinmoy lift a variety of objects and has often commented on his weightlifting feats. “This man is of Godly strength. He is truly amazing. ..He is trying to lift the attitude of the world. He is showing us that mind can surpass matter”. In April 2005, Sri Chinmoy’s calf raise lift was featured in Muscle and Fitness magazine as the second most impressive sporting achievement of the year. In September 2006, Sri Chinmoy lifted both Bill Pearl and world champion strongman Hugo Girard at a major body-building competition before an audience of some 1,500 spectators."
   },
   {
      "imageName":"m6",
      "name":"Music",
      "description":"During his Ashram days Sri Chinmoy received singing lessons from a esrajmusical teacher, which helped him to train his voice. However, most instruments he plays are self-taught; Sri Chinmoy preferred an intuitive approach which enabled him to compose music from the heart. He has performed at over 700 public concerts; usually he dedicated these concerts to world harmony or to certain individuals whom he felt had contributed greatly to the progress of the world. These included President Gorbachev, President Mandela and Mother Teresa. In 1993, Sri Chinmoy offered 39 concerts in honour of Swami Vivekananda attending the inaugural World Parliament of Religions in 1893. Swami Vivekananda was one of the first Indian Gurus to visit the West and he lived on earth for only 39 years. At these concerts Sri Chinmoy plays on a variety of instruments; these include traditional musical instruments such as Flutes and Cellos, but also less well known instruments. His most favourite instrument was the North Indian esraj. Sri Chinmoy’s music is meditative and soulful, appealing to the heart rather than the mind. “Music is the inner or universal language of God. I do not speak French or German or Italian, but if music is played from any of those countries, immediately the heart of the music enters into my heart”. Although his aim is to create meditative music, some of Sri Chinmoy’s performances on keyboard instruments also express tremendous power and dynamism, especially the organ, piano and synthesizer. As a composer he has composed over 21,000 songs in both English and Bengali. These songs are primarily devotional in nature, expressing different aspects of the seeker’s spiritual journey. Uniquely, Sri Chinmoy has also composed many songs about individuals and individual countries. These songs are a way of honouring individuals and highlighting the good qualities of different countries. There is a strong relationship between the songs of Sri Chinmoy and his poetry. For example, the Bengali poems that he wrote as a teenager were later given melodies and turned into songs.  In recent decades, Sri Chinmoy continued to write poems, but focused on aphorisms. These are sometimes very short and are primarily intended as a means of spiritual instruction. His last major poetry project was a series known as 77,000 Service Trees, of which he completed 50,000."
   },
   {
      "imageName":"m11",
      "name":"World Peace",
      "description":"Through various initiatives, Sri Chinmoy sought to promote greater understanding and harmony between people. To this end, he met with people from different walks of life and prominent world leaders to exchange ideas and offer mutual encouragement. In June 1988, he initiated a unique programme called “Lifting Up the World with a Oneness Heart”. 29 During this programme, Sri Chinmoy would physically lift each honoree overhead in a specially constructed machine. It is a symbolic lift; Sri Chinmoy said that it is a way for him to offer gratitude to those who have made a most significant contribution to the betterment of the world. To combine running with his aspiration for greater world peace, in 1987, Sri Chinmoy founded the Sri Chinmoy Oneness-Home Peace Run it was also temporarily known as the World Harmony Run. The World Harmony Run is an international torch relay. The stated aim of the World Harmony Run is: “The World Harmony Run is a global relay that seeks to promote international friendship and understanding. As a symbol of harmony, runners carry a flaming torch, passing it from hand to hand between members of thousands of local communities, travelling through over 100 nations around the globe.The World Harmony Run is organized by an international network of volunteers inspired by Sri Chinmoy’s vision of a more peaceful world. Another initiative founded by Sri Chinmoy is The Oneness-Heart-Tears and Smiles programme. This is a humanitarian project that has offered material aid to 45 countries in the world. Sri Chinmoy said the aim is to offer more than just charity: “With our loving hearts, we identify and become one with what others are. This power that loves can solve world problems. This power is full of self-giving, not with a sense of sacrifice, but with the feeling of serving all humanity as our own brothers and sisters. Through both our loving silence and devoted service, we contribute to the betterment of the entire world.” Even in the evening of his life, Sri Chinmoy was remarkably prolific. He constantly looked for new challenges and new ways to offer inspiration. In addition to his numerous outer activities, Sri Chinmoy, also served as a guide to approximately 6,000 meditation students around the world. He considered the spiritual progress of his students to be one of his most important tasks. Numerous people who have had the opportunity to meet and get to know Sri Chinmoy have commented on his goodness of spirit, impeccable character and selfless dedication to promoting global harmony. “Sri Chinmoy is an inspiring symbol and apostle of humanity’s striving for peace… That is what makes him a living legend and a resonant hymn of peace and goodwill.” - Dr L.M. Singhvi. “For forty years, you have been working to create peace among men and nations through spiritual meditation, music, literature, art, athletics and humanitarian service.” – President Ramaswami Venkataraman (India) (source The Luminous life of Sri Chinmoy). Vast as his outer achievements are, many consider that to write the biography of a spiritual master is actually quite difficult because most of their real action is on an inner plane. Writing in Hinduism Today: “Sri Chinmoy’s spiritual achievements eclipse his outer feats, vast as they are  The marrow of his path is mystic communion, with the Absolute within; through prayer and meditation, approached with an ingenuous purity, tinged, like his kaleidoscopic wardrobe, with an enchanting other-worldliness.”"
   }
]
